{"total":14939,"page":8,"results":[{"publishers":["Apress"],"title":"JavaFX 2.0: Introduction by Example","description":"<span><p><em>JavaFX 2.0: Introduction by Example</em> provides a quick start to programming the JavaFX 2.0 platform. JavaFX 2.0 provides a rich set of APIs for use in creating graphically exciting client applications written solely in Java. You get a large set of customizable components that can be skinned using CSS techniques that you already know from doing web development. The platform even includes a web rendering engine enabling you to mix HTML content into your applications. Hardware acceleration means that your applications are fast and snappy, taking full advantage of modern graphics processing support at the hardware level. JavaFX 2.0 opens the door to business applications that look good, are fun to use, that take advantage of the medium to present data of all types—text, audio, video, etc.—in ways that engage the user and lead to increased productivity.</p><p>Getting started with JavaFX 2.0 is surprisingly easy. You already have the Java skills. Very likely you know enough of CSS to get by. All that's left is to get a leg up on the API, and that's where <em>JavaFX 2.0: Introduction by Example</em> can help. In this short book, author <b>Carl Dea</b> takes you through a series of engaging, fun-to-work examples that bring you up to speed on the major facets of the platform. Begin with the fundamentals of installing the software and creating a simple interface. Move in progressive steps through the process of developing a working dialog box for an application. Then let the fun begin as you explore images and animations, audio and video, and finally learn to embed JavaFX applications in a web page as well as embedding HTML5 content within an application. At the end of this book you'll have a good grasp of what JavaFX is all about, and you'll be ready to begin your journey towards mastery of the platform.</p><p>Entirely example-based</p><p>Focused on practical applications</p><p>Full of working code for you to adapt and extend</p><p><b>What you'll learn</b></p><p>Install JavaFX 2.0 and configure your environment</p><p>Create applcations menus and dialog boxes</p><p>Design forms for data entry</p><p>Work with images and animations</p><p>Embed audio and video into your applications</p><p>Deploy JavaFX applications in a browser</p><p><b>Who this book is for</b></p><p><em>JavaFX 2.0: Introduction by Example</em> is aimed at Java programmers wanting to learn the JavaFX 2.0 platform for designing graphic- and media-rich client applications for the enterprise. Readers should be familiar with Java, and preferably also with the NetBeans Integrated Development Environment.</p></span>","url":"https://www.safaribooksonline.com/api/v1/book/9781430242574/","average_rating":0,"cover_url":"https://www.safaribooksonline.com/library/cover/9781430242574/","popularity":0,"content_type":"book","id":"https://www.safaribooksonline.com/api/v1/book/9781430242574/","virtual_pages":254,"timestamp":"2016-07-16T00:44:25.246Z","isbn":"9781430242574","source":"application/epub+zip","issued":"2011-12-07T00:00:00Z","date_added":"2013-10-30T15:43:13.092Z","format":"book","number_of_reviews":0,"web_url":"https://www.safaribooksonline.com/library/view/javafx-20-introduction/9781430242574/","authors":["Carl Dea"],"archive_id":"9781430242574"},{"publishers":["Packt Publishing"],"title":"Learning Three.js – the JavaScript 3D Library for WebGL - Second Edition","description":"<span><span><p><b>Create stunning 3D graphics in your browser using the Three.js JavaScript library</b></p><p><b>In Detail</b></p><p>Modern browsers support WebGL, which makes it possible to create 3D graphics in a browser without having to use plugins such as Flash and Java. Programming WebGL, however, is difficult, complex, and very difficult to debug. With Three.js, it is possible to create stunning 3D graphics in an intuitive manner using JavaScript, without the need to know the details of WebGL.</p><p>Learning Three.js  the JavaScript 3D Library for WebGL, Second Edition, is a practical, example-rich book that will help you learn about all the features of Three.js. This book will show you how to create or load models from externally created models and realistic-looking 3D objects using materials and textures. You'll also learn how to use the HTML5 video and canvas elements as a material for your 3D objects, different ways of animating your models, skeleton-based animation, and how to add physics such as gravity and collision detection to your scene. By the end of the book, you'll know everything that is required to create 3D animated graphics that run in any browser using Three.js.</p><p><b>What You Will Learn</b></p><li><p>Use the different geometries that are provided by Three.js</p></li><li><p>Apply realistic lighting and shadows to the 3D objects you have created</p></li><li><p>Use the different camera controls provided by Three.js to effortlessly navigate around your 3D scene</p></li><li><p>Make use of advanced textures on materials to create realistic-looking 3D objects by using bump maps, normal maps, specular maps, and light maps</p></li><li><p>Import and animate models from external formats, such as OBJ, STL, Collada, and many more</p></li><li><p>Create and run animations using morph targets and bone animations</p></li><li><p>Explore the Physijs JavaScript library to apply physics to your 3D objects</p></li><li><p>Interact directly with WebGL by creating custom vertex and fragment shaders</p></li><p>Downloading the example code for this book. You can download the example code files for all Packt books you have purchased from your account at <a href=\"http://www.PacktPub.com\">http://www.PacktPub.com</a>. If you purchased this book elsewhere, you can visit <a href=\"http://www.PacktPub.com/support\">http://www.PacktPub.com/support</a> and register to have the files e-mailed directly to you.</p></span></span>","url":"https://www.safaribooksonline.com/api/v1/book/9781784392215/","average_rating":0,"cover_url":"https://www.safaribooksonline.com/library/cover/9781784392215/","popularity":141,"content_type":"book","id":"https://www.safaribooksonline.com/api/v1/book/9781784392215/","virtual_pages":472,"timestamp":"2016-07-06T18:53:33.319Z","isbn":"9781784392215","source":"application/epub+zip","issued":"2015-03-31T00:00:00Z","date_added":"2015-04-02T16:04:58.582Z","format":"book","number_of_reviews":0,"web_url":"https://www.safaribooksonline.com/library/view/learning-threejs/9781784392215/","authors":["Jos Dirksen"],"archive_id":"9781784392215"},{"publishers":["O'Reilly Media, Inc."],"title":"An Introduction to Web Development in HTML, CSS, and JavaScript","description":"<span><span><div><p>There are lots of tutorials on web development with HTML and CSS, but if you’re just starting out on this path, this video course from sisters Cassidy and Camryn Williams is the one for you: it makes learning easy, accessible, and definitely fun. You’ll quickly learn the basics of designing and building your own web pages.</p><p>Cassidy and Camryn have both taught in-person HTML and CSS workshops to students ranging from middle school to college. In this video, you’ll code along with them as you learn how to build web pages with HTML and define the look and format with CSS. Along the way, you’ll learn a host of best practices as well as how avoid common pitfalls.</p><ul><li>Explore HTML’s basic tag and text structure</li><li>Learn individual HTML tags for images, line breaks, and tables</li><li>Dive into CSS elements, such as background color, floating, positioning, margins, and padding</li><li>Learn about new capabilities in HTML5 and CSS3</li><li>Consider various HTML and CSS frameworks</li><li>Understand how to host and maintain a website</li></ul><p>Cassidy Williams is a software engineer and developer evangelist at Venmo. A graduate in Computer Science from Iowa State University, she has a passion for helping STEM students excel. Cassidy has spoken at the Grace Hopper Celebration for Women in Computing, the National Center for Women &amp; IT Summit, the United Nations, and the U.S. Science and Engineering Festival, and other events.</p><p>Camryn Williams, a Computer Science student at Iowa State University, holds computer science and web development workshops for middle school, high school, and college students. An intern for Microsoft, Google, and (soon) Apple, she attended the White House Tech Inclusion Summit hosted by CTO Todd Park and loves mentoring young women in technology.</p></div></span></span>","url":"https://www.safaribooksonline.com/api/v1/book/9781491923320/","average_rating":0,"cover_url":"https://www.safaribooksonline.com/library/cover/9781491923320/","popularity":689,"content_type":"book","id":"https://www.safaribooksonline.com/api/v1/book/9781491923320/","virtual_pages":0,"timestamp":"2016-07-06T17:37:28.717Z","isbn":"9781491923320","number_of_reviews":0,"duration_seconds":3569,"issued":"2015-03-23T00:00:00Z","date_added":"2015-05-13T13:00:55.042Z","format":"video","source":"application/epub+zip","web_url":"https://www.safaribooksonline.com/library/view/an-introduction-to/9781491923320/","authors":["Cassidy Williams","Camryn Williams"],"archive_id":"9781491923320"},{"publishers":["Addison-Wesley Professional"],"title":"JavaServer Faces LiveLessons (Video Training)","description":"<span><p><b>5+ Hours of Video Instruction</b></p><p>This engaging video by the co-author of the bestselling Core\nJavaServer Faces,¿provides expert guidance on building robust\napplications with minimal hand coding and maximum\nproductivity–without requiring any knowledge of servlets or other\nlow-level plumbing. It provides a complete explanation of the basic\nbuilding blocks–from using standard JSF tags, to working with data\ntables, and converting and validating input, as well as coverage of\nadvanced tasks, such as event handling, extending the JSF\nframework, and connecting to external services. Each lesson\nincludes solutions to a variety of common challenges, as well as\nnotes on debugging and troubleshooting.</p><p>Table of Contents</p><p>Lesson 1: Getting Started</p><p>Lesson 2: Tag Libraries</p><p>Lesson 3: Pillars (components, managed beans, expression\nlanguage)</p><p>Lesson 4: Facelets</p><p>Lesson 5: Input Processing</p><p>Lesson 6 Resources and Internationalization</p><p>Lesson 7: Events</p><p>Lesson 8: Ajax</p><p>Lesson 9: Composite Components</p><p>Lesson 10: REST</p><p>LiveLessons Video Training series publishes hundreds of\nhands-on, expert-led video tutorials covering a wide selection of\ntechnology topics designed to teach you the skills you need to\nsucceed. This professional and personal technology video series\nfeatures world-leading author instructors published by your trusted\ntechnology brands: Addison-Wesley, Cisco Press, IBM Press, Pearson\nIT Certification, Prentice Hall, Sams, and Que. Topics include: IT\nCertification, Programming, Web Development, Mobile Development,\nHome &amp; Office Technologies, Business &amp; Management, and\nmore. View All LiveLessons</p></span>","url":"https://www.safaribooksonline.com/api/v1/book/9780132761765/","average_rating":0,"cover_url":"https://www.safaribooksonline.com/library/cover/9780132761765/","popularity":129,"content_type":"book","id":"https://www.safaribooksonline.com/api/v1/book/9780132761765/","virtual_pages":0,"timestamp":"2016-07-07T14:49:36.082Z","isbn":"9780132761765","number_of_reviews":0,"duration_seconds":21384,"issued":"2011-09-09T00:00:00Z","date_added":"2014-04-30T22:06:26.391Z","format":"video","source":"application/epub+zip","web_url":"https://www.safaribooksonline.com/library/view/javaserver-faces-livelessons/9780132761765/","authors":["David Geary"],"archive_id":"9780132761765"},{"publishers":["Virtual Training Company, Inc."],"title":"Advanced Java Programming (Java SE 7)","description":"<span><p>Java is a powerful language for cross-platform,\nobject-oriented application programming. It can be found in many\ntypes of applications such as standalone, web, enterprise, and\nmobile. Advanced Java Programming is a higher level study of many\nadvanced Java topics including JDBC, RMI, EIO, collections,\nassertions, logging, and concurrency. This advanced course by\nseasoned Java Developer David Saenz will demonstrate the power of\nJava and how to implement cutting edge apps that can perform well\nin mission critical applications. Source code is included. To begin\nlearning today, simply click on the movie links.</p></span>","url":"https://www.safaribooksonline.com/api/v1/book/9781618661098/","average_rating":0,"cover_url":"https://www.safaribooksonline.com/library/cover/9781618661098/","popularity":417,"content_type":"book","id":"https://www.safaribooksonline.com/api/v1/book/9781618661098/","virtual_pages":0,"timestamp":"2016-07-07T18:56:10.427Z","isbn":"9781618661098","number_of_reviews":0,"duration_seconds":26757,"issued":"2013-07-11T00:00:00Z","date_added":"2014-04-23T15:10:12.291Z","format":"video","source":"application/epub+zip","web_url":"https://www.safaribooksonline.com/library/view/advanced-java-programming/9781618661098/","authors":["David Saenz"],"archive_id":"9781618661098"},{"publishers":["Infinite Skills"],"title":"Introduction to IoT Programming with JavaScript","description":"<span><span><p>In this Introduction to IoT Programming with JavaScript training course, expert author Patrick Catanzariti will teach you how to create interactions with connected devices and dashboards. This course is designed for users that already have experience with web development, JavaScript, and Node.<br/><br/>You will start by learning how to build your first dashboard, including setting up a modular Node server and getting your server onto the web. From there, Patrick will show you how to set up an Arduino, display Arduino data, and go wireless with Arduino Yun and node-serialport. This video tutorial also covers Spark, Tessel, pairing Android and JavaScript using on{X}, and voice recognition with Wit.ai. Finally, you will learn how to control your dashboard with new input devices, and learn about Pebble Watch dev. <br/><br/>Once you have completed this computer based training course, you will be fully capable of creating your own web dashboard to display Internet of Things data. Working files are included, allowing you to follow along with the author throughout the lessons.</p></span></span>","url":"https://www.safaribooksonline.com/api/v1/book/9781771374002/","average_rating":0,"cover_url":"https://www.safaribooksonline.com/library/cover/9781771374002/","popularity":281,"content_type":"book","id":"https://www.safaribooksonline.com/api/v1/book/9781771374002/","virtual_pages":0,"timestamp":"2016-07-06T19:39:54.231Z","isbn":"9781771374002","number_of_reviews":0,"duration_seconds":14786,"issued":"2015-03-09T00:00:00Z","date_added":"2015-04-01T01:00:44.671Z","format":"video","source":"application/epub+zip","web_url":"https://www.safaribooksonline.com/library/view/introduction-to-iot/9781771374002/","authors":["Patrick Catanzariti"],"archive_id":"9781771374002"},{"publishers":["O'Reilly Media, Inc."],"title":"The Java Sessions: The Best of OSCON 2011","description":"<span><p>Whether you want to tackle cloud computing, big data, or\nmobile development, this complete video compilation of OSCON Java\n2011 shows you how Java and open source technologies work together\nto help you solve a variety of challenges. Learn about Grails,\nGradle, Jenkins, Cassandra, Android development, and much more -\nand discover why Java and open source are a killer\ncombination.</p></span>","url":"https://www.safaribooksonline.com/api/v1/book/9781449315030/","average_rating":0,"cover_url":"https://www.safaribooksonline.com/library/cover/9781449315030/","popularity":0,"content_type":"book","id":"https://www.safaribooksonline.com/api/v1/book/9781449315030/","virtual_pages":1256,"timestamp":"2016-07-07T01:32:48.372Z","source":"application/epub+zip","duration_seconds":39759,"issued":"2011-08-25T00:00:00Z","date_added":"2014-09-24T14:13:29.743Z","format":"video","number_of_reviews":0,"web_url":"https://www.safaribooksonline.com/library/view/the-java-sessions/9781449315030/","authors":["O'Reilly Media, Inc."],"archive_id":"9781449315030"},{"publishers":["Infinite Skills"],"title":"Beginners Java Programming","description":"<span><span><p>In this video training course on Programming with Java for Beginners, expert author and professor Mike McMillan starts you along the path to enlightenment with Java, by introducing you to the basic concepts, tools and functions that you will need to build fully functional programs with the popular programming language, Java.<br/>Starting with the download and installation of the JDK (Java Development Kit), this video tutorial will teach you the different typs of variables (bool, int, etc), what an operator is and how to use it (+,-,%,etc). You will learn about object-oriented programming, and creating classes and objects. You will control your programs with different types of control loops such as while and for, as well as making decisions with if-else statements. Each chapter is capped of with exercises so you can put in to practical use, what you learn in each section.<br/>By the completion of this instructional video course, you will have the base knowledge that you need to create functional and useful Java programs. This video tutorial comes complete with working files and code samples, so you can work alongside the author as he teaches you each concept.</p></span></span>","url":"https://www.safaribooksonline.com/api/v1/book/9781926873565/","average_rating":0,"cover_url":"https://www.safaribooksonline.com/library/cover/9781926873565/","popularity":126,"content_type":"book","id":"https://www.safaribooksonline.com/api/v1/book/9781926873565/","virtual_pages":1082,"timestamp":"2016-07-07T01:29:58.597Z","isbn":"9781926873565","number_of_reviews":0,"duration_seconds":35148,"issued":"2011-07-20T00:00:00Z","date_added":"2014-09-24T16:49:42.479Z","format":"video","source":"application/epub+zip","web_url":"https://www.safaribooksonline.com/library/view/beginners-java-programming/9781926873565/","authors":["Mike McMillan"],"archive_id":"9781926873565"},{"publishers":["O'Reilly Media, Inc."],"title":"Beginning Programming with JavaScript","description":"<span><span><div><p>If you’ve never programmed before, or have just begun learning a language such as Java, this video course is the ideal way to get started with JavaScript. Instead of learning JavaScript in the context of web development—as many teaching resources would have you do—you’ll learn the principles of the language itself.</p><p>Host Semmy Purewal takes you through you the language basics, including variables, type-checking, loops, objects, arrays, and array methods. Download this video course or view it through our HD player and get going today.</p><ul><li>Install a text editor and get the course examples</li><li>Learn JavaScript’s basic functions, such as how to create and call them</li><li>Declare and using variables (basic calculations with functions)</li><li>Work with if-statements and Boolean expressions</li><li>Learn about loops, using basic examples and problems</li><li>Delve into array basics and use for-loops to traverse arrays</li><li>Learn data wrangling with built-in array functions</li><li>Understand how to use array functions on maps</li></ul><p>Semmy Purewal has worked with a diverse group of clients, including startups, nonprofits, and research labs, during his decade-long tenure as a computer science instructor and freelance JavaScript consultant. These days, he works primarily as a software engineer.</p></div></span></span>","url":"https://www.safaribooksonline.com/api/v1/book/9781491917824/","average_rating":0,"cover_url":"https://www.safaribooksonline.com/library/cover/9781491917824/","popularity":284,"content_type":"book","id":"https://www.safaribooksonline.com/api/v1/book/9781491917824/","virtual_pages":0,"timestamp":"2016-07-06T19:48:05.346Z","isbn":"9781491917824","number_of_reviews":0,"duration_seconds":21267,"issued":"2015-01-20T00:00:00Z","date_added":"2015-03-19T13:00:23.309Z","format":"video","source":"application/epub+zip","web_url":"https://www.safaribooksonline.com/library/view/beginning-programming-with/9781491917824/","authors":["Semmy Purewal"],"archive_id":"9781491917824"},{"publishers":["Packt Publishing"],"title":"Learning Object-Oriented JavaScript","description":"<span><span><p>Acquire advanced JavaScript skills and create complex and reusable applications </p><p><b>About This Video</b></p><li><p>Discover the important concepts of object-oriented programming (OOP) and make your life easier, more enjoyable, and more focused on what you love doingcreating</p></li><li><p>Develop reusable code while creating three different clocks, a classic clock, a text clock, and an alarm clock.</p></li><li><p>Utilize the advantages of using constructors, methods, and properties to become an expert</p></li><p><b>In Detail</b></p><p>One of the most common issues faced by JavaScript developers is what is known in the industry as spaghetti code. This issue is common when developers don't know how OOP works, as they end up creating layers of code on top of each other, resembling spaghetti. The goal of OOP is to organize your code and make your life easier.</p><p>This course will help you change some common coding practices and empower you by giving you the tools you need for more efficient development.</p><p>You start with building a simple digital clock and use this as the case sample for the course. Then, we begin exploring the object-oriented tools in JavaScript such as the constructor, scope, methods, and properties. Next, we dive even deeper as we explore the wonderful world of prototypes, static methods and properties, and namespaces. We then turn our attention to inheritance and finally end the course with a section to dedicated events and callbacks. As we explore what they are and how to use them, we complete our sample by creating a fully usable alarm clock.</p><p>With this course, you will be an expert in OOP with JavaScript in under 3 hours!</p></span></span>","url":"https://www.safaribooksonline.com/api/v1/book/9781783554331/","average_rating":0,"cover_url":"https://www.safaribooksonline.com/library/cover/9781783554331/","popularity":173,"content_type":"book","id":"https://www.safaribooksonline.com/api/v1/book/9781783554331/","virtual_pages":0,"timestamp":"2016-07-06T20:46:15.538Z","isbn":"9781783554331","number_of_reviews":0,"duration_seconds":10117,"issued":"2014-12-31T00:00:00Z","date_added":"2015-02-14T01:00:58.738Z","format":"video","source":"application/epub+zip","web_url":"https://www.safaribooksonline.com/library/view/learning-object-oriented-javascript/9781783554331/","authors":["Ben Fhala"],"archive_id":"9781783554331"}],"facets":{"facet_queries":{},"facet_ranges":{},"facet_fields":{"topic_uuids":["02b4b7a8-c9c4-46fa-94ad-4686797e39a7",33,"0313584b-2704-453a-acfd-d3c293df09af",1,"0397dac1-feca-4adc-b98b-668e4b9d33de",646,"052ce1ab-0076-42a2-aa30-129c640d5ac7",303,"0593328c-e7c8-4ee0-826f-2181ce172c6a",9,"0636aa5f-2457-40a8-bd05-1775bd1d0a8a",232,"06d288f0-1957-4897-ba3b-f63b3ee13e3d",8,"0ad7a91b-a431-4842-b674-27cfffb9c859",43,"0e1bec67-fc52-4cb0-a222-78c1b9eef7d5",216,"0ebe1976-73f4-486a-998f-43ddf02800ea",269,"0ec314b3-3c55-4522-a7d4-2fd9254ce438",82,"0fea2227-087f-47f3-b0dd-c9daf24329d3",36,"10d7c40a-0e6f-4b1d-b17e-69b644f777a4",60,"111bdc9a-1809-46c8-8489-19201b21913f",237,"11681e4a-2613-4040-a5c3-d37900b7cf9d",7,"11ea412a-4e26-4897-a96a-6d1323968eab",33,"1237f966-885b-4bc2-8ccb-052da10f6915",27,"12526985-d5c4-4233-93e2-0aec34014a7c",14,"12accbcf-56bd-4efd-80ce-b556697d590c",11,"13fe40d4-3309-429e-a0b8-93b7f2b583fa",14,"149149db-ab2f-4ecb-931e-a56d1e95e688",250,"155a6e26-d2bf-444d-a99b-13f8a9deb519",6,"159ae6c7-6277-45c7-b676-39dd88b0a87c",1,"1850fe7b-b49a-4dfc-aac1-b466f8fa1439",78,"1c64fced-c7b5-4c5d-9288-3741a7d7742d",1,"1f9a175c-a561-4931-9361-b34d44a2b8ec",12,"2087e5fa-3527-4a29-8911-f731bae589b7",41,"213f9559-0530-48a7-8e37-74a8546fb5c2",11,"233982f0-e6ff-464e-a755-6b94617ba909",15,"23ba98c8-a00d-488f-a2e9-3f3b6fd44287",25,"240931fc-0ab4-4df2-9b50-0f57c763b760",8,"2448eb5e-b75f-4c84-b3a4-bfde13534a0b",59,"2508c43c-31e5-401c-84c7-5428866fe7ca",60,"256d76dd-5d9e-46b9-b81a-5217c0b98639",24,"25e063cc-1900-4694-877f-39ea321940f8",41,"260192d1-24b9-405a-b757-cd1853ec63bb",102,"29526db1-bacc-4e89-83f1-9a821ab6f879",27,"2987ea5a-2aa9-4411-a2bd-a2a6e6fe7c84",16,"29e11d4e-3b8c-422b-8963-36e09d4fa1c2",6,"2a35eb8f-8e3f-4d94-9af8-aa804f7b3d60",60,"2b5967a9-eae7-4aa6-b00a-1732d0f7bab8",9,"2ce31e62-d6fc-427d-88d1-80ff3c9e2601",13,"2e2452b2-7add-4ac3-be50-21ccca268897",16,"2f2150cc-b554-47f7-bc3a-799f8befe3dc",327,"30b687e2-4279-4ff6-b972-38de6de84a6d",12,"323b3817-1d03-4221-854f-78ed0822462e",6,"33e96a88-4d1e-4096-8889-d6dfef60f6c4",78,"3478843a-8b3c-46e0-b2bf-e1c5019456bc",4,"34bba3ca-288a-4f71-8975-dffa852cc9c2",117,"36dff003-385a-4e1e-b3f0-b59cb5b64f93",71,"38afbbd0-d7fb-4563-9b3d-d401040366da",23,"3ad4eed0-0dd7-4017-8a84-9d09f7f39ea7",291,"3af6fc55-9b4a-486e-8102-9993b17418b3",36,"3af8f002-897e-4e9c-ab4f-f62539ffa2f8",1,"3b5ae32e-2f8e-442c-8a2b-90730fce3948",224,"3b85a7f6-ec1e-46a4-bee4-d1ebe7e23c9f",46,"3e13dfa2-d0d0-4a3b-951d-d14ab8807d8e",140,"3e3be4ff-cf0e-4681-94ad-d3aa8467672f",272,"405dc93a-4024-43c7-8e17-301555c5505b",21,"44093bc6-735d-43ca-a257-deeed2ac5587",8,"466a90dc-235c-44cb-a01c-5cf8f56bf3e0",8,"46ce4a86-f2ef-4a99-bfe1-4e860e0e9e2e",2,"478fa6df-52f2-4628-99d0-838b13e187c5",13,"47f83788-2b66-4cbc-9c28-7ded438dddfb",5,"48a8f7c4-434f-489a-9cd4-8c88e7d2dc50",98,"49421149-5b16-4ae9-a8f9-ce736fe40c98",120,"49a2bf99-6967-43f1-a554-41a7494af7be",137,"49c4f913-c736-4acd-bff5-907d83efa7c7",41,"4b75d7a5-4123-4aef-a37a-6daa7edb47cc",7,"4bf61a6e-1ba5-403d-adbd-6eb12edaca98",80,"4c06b39a-f1cc-4559-a488-8c122a3ffdf8",59,"4c0f007d-f55f-4701-a81e-004a9b294d52",26,"4c234e5e-08b6-44ea-b222-1c7935730ce4",25,"4d0a4cb4-0045-4f63-aa9a-c5efe757559d",6,"4f7b0b5d-dcce-4199-9084-b4bf44f4db00",2,"50af185b-9e77-45bf-a7d2-ebcf7bd1a4a7",13,"522cab8f-334e-4f52-af96-3f43e8919f0a",17,"5272f17e-5e3d-4a80-bd0b-7e8808bd5579",20,"53182b0c-3987-45ca-874c-d56c5f6c58cc",9,"540ada21-425d-4d98-b1ba-eac7a4ce7a07",19,"54194d41-f552-4cf1-955f-fc880fab3956",66,"559116d9-a3d4-42b7-8b53-0db24c84da46",61,"5667e989-c7bf-492a-ac7f-4bc13e6eb6c6",50,"566e9de9-5b89-4983-8896-536c639b3e3c",505,"56e68761-2cc7-4465-8678-8964cce9fed2",11,"594c39d1-e83d-48ca-bfd8-8bd859e6f04a",54,"5aa0ad69-00f8-4a06-b269-15172fa754b2",19,"5c647503-6a28-4c7d-a5b2-1be21bf0ad8b",468,"5d0da492-c9d3-4bfa-9866-5a6746262541",30,"5dbef26a-edc8-4704-94c6-499a155b8890",34,"5e1c2283-1c86-424e-a5fc-fa92902296a7",25,"60c908f1-2c2b-48ae-8929-92db631c17c3",32,"60eed88f-b5e4-4ec3-9b07-e78c2810283b",20,"631fa938-c2ba-44ee-8ac5-6a5efa7ba074",9,"63e37f9c-879a-4607-aca4-0261856e9945",10,"6492c049-d68e-4d65-956d-f5556eea1d00",17,"6641c861-7926-40be-bc6c-5ebfefe32969",68,"680a9c1f-b320-4e9d-af16-24e45f29cc29",64,"6b35efae-c50a-424d-bf29-62b6de42d9ae",107,"6b842acd-0153-4181-bb2a-dc8064a4b686",9,"6c17e8ed-b260-46d7-8130-953e66ac9af2",4,"6d507edb-0dd0-4be3-bf4b-c8a274ce3964",13,"6d78d1e2-a0b3-4cc7-ba71-cc6dcd1815ba",177,"6dcb21c5-c1c2-4f70-a558-422c21ab3527",95,"6dd30564-a74a-45d1-ba96-a35f06f81b1d",40,"6eae4c59-d48b-4add-b680-30051c19ae32",41,"6ee649a7-a1dc-47e4-b58f-9d02221e74e1",159,"6f7bc06a-208a-4347-bc6b-85abe88f9d74",118,"6f89de30-d4e1-43dc-b4f7-5bb20dd69c05",44,"71997ad9-a839-4fc4-87ad-e6075342746c",12,"72905113-4451-48d8-ab02-64c399f95321",31,"7563815b-7c58-4310-a99d-233075f0d6fa",7,"7c119542-e25e-4e2a-b3be-91de34403b9b",59,"7c12b0f8-c5f8-4b21-ab2d-ab77b39e2b36",137,"7c1e9d1f-155b-4d00-acc3-d8acfa1170d4",185,"7c36a081-5edf-4129-8d73-ee639e04e215",3,"7c56ec53-fe29-4f84-985d-ad58fc8212e6",10,"7c83a104-91ec-41a6-80e5-c56a43d7b3c8",58,"7e0a8a17-b55a-4ee0-ab59-ce6b2f1efed8",19,"7fbbd3e8-2b7a-49df-af55-69d228697e9f",356,"822dfa0d-bc49-478d-8c64-afdb1e0ccc76",49,"82593fbd-347d-4c20-97a5-7ba9d321a5ea",140,"82d6d1e7-41d3-4923-a225-952e6d9907e4",9,"82dbb141-b832-4e09-9ab2-22131749ddd9",38,"84ac70a1-2803-4570-b58b-6bb4566d4d15",29,"84db4d6e-af44-4fed-b3a7-deafeb6e8c38",102,"85f6e2e0-9a36-43b4-ab36-bc334484cd33",7,"86e26a91-a9e8-4001-ac04-8c7666ac7d42",56,"88027c5d-6214-4c90-9e6d-f4bae81884da",62,"880bbc5d-4643-4396-b4d1-3256d0106e83",290,"884caad4-44d1-40e0-b9c9-a1761f77245b",10,"8e478238-16fd-46b0-937f-6cd502addc6c",597,"8ef408fe-bb96-4e9e-98e3-14592df11dea",110,"8ef4bf43-18ee-4d66-aefc-c801b6ada5ae",89,"8f965e36-c191-443c-beca-751fe482e431",1,"910afe30-46df-449d-89f2-271e9f05a277",20,"9161e675-cbd7-44d7-a4de-fc2bfed39e5d",42,"932e0d17-38ce-49f2-8dc7-8dbd24040738",82,"9865f707-b09d-4e88-9206-8bdc883111c0",36,"99ffa611-547d-4a89-a38f-6c51ea13f3fb",2,"9c515291-6713-4698-82e9-cb03013659be",8,"9d0404c4-ea95-473e-bbfd-470974ca4ff2",154,"9e368699-1c8f-484a-ac64-1309efdf21e3",9,"9e4127d4-6813-4e8c-98f6-b5617fae9d53",55,"9f77cf2e-8386-4896-9a5f-11e380ffb5ce",185,"a0765028-6564-479c-ad97-0bbb7cd80a8f",415,"a11eb76f-d9dc-4394-b3ff-14b188d6b3b4",33,"a3bafac8-8a29-4fdd-b62b-78acbccba025",13,"a4496ea6-2a47-4e49-919c-04e6babb575a",170,"a47f044e-10d5-4d51-a140-e1c392a88421",310,"a500601f-0240-44e5-968d-6e7a6ad91b04",16,"aa4b0bcd-cbf5-467d-b638-eff970ea8fba",113,"ab9b3b34-b71d-42b3-b8af-5451ed093c2c",5,"abb7b3e1-aa60-429f-ae0e-639f74dec147",1,"ad81484a-4f29-4b4a-a8b1-a4d2539a9936",123,"af66b49e-93c1-423b-ac06-be57ed9921fd",195,"b0deae69-1df5-4ce7-a76d-e17db2aff69b",47,"b1009eff-9cc7-47b6-9737-67ccabcc5ff1",8,"b21ef40d-fc28-499f-ba30-2f60faa7a381",48,"b2f08628-f93a-4b09-b01a-710389145a22",22,"b57c844a-d2eb-423d-8d40-a64304fe45f1",105,"b6380e48-4a95-4774-8884-cfc3a9a52f58",16,"b6d6f763-ef3e-4436-9aa1-3d6e047a3e18",125,"b7f4bb94-15bf-4de9-be8f-557d6495f493",15,"b89f187d-0e0e-46f3-9940-e101ecd2d9e6",22,"bb764838-996d-4d46-9070-e232c66075b1",17,"bd15824a-f06a-4791-999e-7ed60e030f77",53,"bd879fbe-cccf-4033-987b-705dca76a159",47,"c091ead8-3288-486a-b785-1d64a631e58a",23,"c0dce11b-7d59-4fce-97e0-f2337398d499",32,"c1bacb48-b34a-47b0-9fef-4bec6a068074",34,"c1f92085-7fb4-4cff-a6bd-1993c30aea11",33,"c2bb2622-1f64-4622-a0d9-2d4aad213520",8,"c363ab45-daa6-442e-b572-1a4467aceeb0",151,"c3b129e7-2c72-45fc-9daa-2da35f482afb",15,"c8874848-7dfb-42a7-ae9c-49df009e2534",69,"c9794b65-13fd-45da-8de1-e5fe7450e574",141,"ca821063-c6d4-46cb-bd48-7980967476a6",21,"cd8a5ec8-8098-4dad-a573-7f2802e54509",86,"cda50ea0-3a3a-4d54-89bb-a7a4179365e6",235,"ce2ac267-f221-43c1-add9-cdc9b6ebba94",9,"ceb1b16a-f959-4bfb-82e0-dbf887ed03de",121,"d002e8f7-5968-4975-9417-6b09a7a867b1",9,"d142c7fd-700e-4710-90c9-29b08414ab08",1,"d2d88b9a-8f32-405a-bd14-1006ad852a9e",293,"d44971fb-85d4-4279-8b70-09eab16cbaaa",19,"d66a3362-4bc5-44a2-aee0-69a0e5a84b20",33,"d830dd72-b21e-4f03-b999-b7b5ab89ce97",12,"d94661ad-ca0a-477a-857e-51ab9457b588",1,"daa6bd9d-1b75-4b79-814f-32c04f94c734",9,"db5a514e-ac58-4175-a077-a28471f3afa1",7,"ddc74811-4b1c-4043-bdd8-d4d9309b4adb",113,"de5e24ee-651f-4fd0-bf87-33bbb3eb5626",57,"df9096b5-b21d-4e0d-b743-2f64cf8063a2",71,"e337de49-6e07-42df-ba1e-ed727a4ea47a",18,"e3f5046d-14f1-4adc-a4a9-61e7812fc2a8",5,"eaa8b5b6-00f8-4633-9c6c-8f1505ae2913",135,"ec52ab95-df0b-42ad-861b-5231538eb60c",111,"ee1230f3-0279-4367-9d8c-2a958ed3e4e6",3,"eee841a6-2fbd-439b-b9ac-7d2b82264501",1,"f00d5c62-2aaa-4d13-b9f1-25980773373b",4,"f02f6e09-74f7-4b3f-8812-4fac6b61509f",57,"f0b74a40-3011-4814-b2f0-e161e647cd09",5,"f23f8656-1d95-4457-b0a2-bf4c81a5cb5d",7,"f400fdde-6f3e-4143-9065-8e41c60b7f91",4,"f54509dc-2c1a-49ab-b1a4-271bdbc632ec",23,"f5fa2a9f-0f1c-46ff-808f-89e168480ced",94,"f79a1884-2533-4a20-ab5a-57960a634560",82,"f9c3ec11-ce3c-4930-9684-e0516ff1df93",6,"fb6a8f6c-cce4-4d82-9f8d-1cb8fdb4b5db",41,"fc94942e-012e-4459-acc7-a56dd181eec4",48,"fd1676d0-8639-4b37-b314-cd41cdd1627f",52,"fd5f9f9d-a7d1-4ad3-93b6-740566ac10ba",8,"fd87a47b-bd4a-4762-b2a4-49c2bfed5105",41,"ff88983c-0414-4c03-88de-87d61f51506e",20],"subjects":[".NET",614,"Agile",46,"Analytics",74,"Apple/iOS",248,"Big Data",300,"Business",1100,"Business Communication",452,"C",39,"C++",57,"Certification",2141,"Cisco",148,"Core Programming",1662,"DIY & Hardware",371,"Data Visualization",89,"Databases",1388,"Design",1470,"Digital Media",1836,"Engineering",407,"Entrepreneurship",10,"Game Development",288,"Google/Android",166,"Information Technology/Operations",605,"Innovation",8,"Interaction Design",68,"Java",732,"JavaScript",659,"Leadership",3,"Leading Teams",12,"Lean",121,"Management Communication",1,"Math & Science",448,"Microsoft",736,"Mobile",742,"Networking",703,"New Manager Essentials",1,"Office & Productivity Applications ",60,"Personal & Professional Development",443,"Product Management",5,"Project Management",115,"Python",250,"Security",410,"Social Media",58,"Strategy & Execution",3,"Virtualization",124,"Web Applications & Services",95,"Web Development",2359,"Web Performance",33],"format":["book",14413,"video",526],"publishers_exact":["A Book Apart",11,"A K Peters/CRC Press",10,"AMACOM",27,"AVA Publishing",1,"Academic Press",36,"Adams Media",16,"Addison-Wesley",11,"Addison-Wesley Professional",795,"Adobe Press",118,"Alpha",13,"American Society for Training & Development",8,"Apress",933,"Artima Press",6,"Association for Talent Development",2,"Auerbach Publications",15,"Axzo Press",2,"BCS Learning & Development Limited",7,"Basic Books",7,"Ben Watson",1,"BenBella Books",5,"Berrett-Koehler Publishers",18,"Bibliomotion",1,"Big Nerd Ranch Guides",10,"Bleeding Edge Press",15,"Brainy Software",31,"British Informatics Society Limited",9,"Business Expert Press",19,"Butterworth-Heinemann",8,"CRC Press",22,"Cambridge University Press",64,"Capstone",6,"Career Press",3,"Cengage Learning",1,"Cengage Learning PTR",4,"Center for Creative Leadership",1,"Center for Cryptologic History, NSA",1,"Chandos Publishing",9,"Chapman and Hall/CRC",19,"Cisco Press",181,"Coffing Publishing",3,"Context-Driven Press",2,"Course Technology PTR",203,"DK Eyewitness Travel",3,"DK Publishing",1,"Da Capo Press",4,"David & Charles",1,"De Gruyter Oldenbourg",1,"Digital Press",6,"Diversion Books",4,"Edward Elgar Publishing",2,"Elsevier",8,"Elsevier Science",210,"Essvale",12,"FT Press",69,"FT Publishing International",1,"Focal Press",149,"For Dummies",257,"Frontend Masters",18,"Gilbane Group, Inc.",4,"Gulf Professional Publishing",1,"HOW Books",6,"HRD Press",1,"HarperCollins",4,"Harriman House",3,"Harvard Business Review Press",25,"IBM Press",69,"IBM Redbooks",399,"IGI Global",1437,"IT Governance Ltd",19,"IT Revolution Press",1,"IconLogic, Inc.",9,"Infinite Ideas",3,"Infinite Skills",81,"InformIT",1,"J. Ross Publishing",17,"JIST Publishing",14,"Javvin Press",3,"John Wiley & Sons",756,"Jones & Bartlett Learning",43,"Jossey-Bass",25,"Kauffman Fellows Press",1,"Kogan Page",41,"LID Editorial",1,"Laurence King",5,"LearnToProgram",3,"MC Press",11,"MIT Sloan Management Review",2,"Macromedia Press",16,"Maker Media, Inc",29,"Manning Publications",249,"Marshall Cavendish International (Asia)",20,"McGraw-Hill",167,"McGraw-Hill Education TAB",1,"McGraw-Hill Osborne Media",47,"McGraw-Hill/TAB Electronics",1,"Microsoft Press",364,"Momentum",1,"Momentum Press",11,"Morgan & Claypool Publishers",26,"Morgan Kaufmann",150,"MySQL Press",6,"New Riders",102,"Newnes",28,"Nicholas Brealey Publishing",3,"No Starch Press",85,"North Holland",4,"North Light Books",4,"Novell Press",21,"O'Reilly Media, Inc.",1738,"Open Road Integrated Media",1,"OpenTask",9,"Oracle Press",117,"Packt Publishing",2681,"Patrick Kua",1,"Peachpit Press",253,"Pearson",8,"Pearson Business",2,"Pearson Certification",89,"Pearson Education India",32,"Pearson FT Press",22,"Pearson IT Certification",4,"Pearson India",48,"Pearson International",1,"Pfeiffer",10,"Platinum Press",1,"Pragmatic Bookshelf",93,"Prentice Hall",413,"Princeton University Press",9,"Project Management Institute",1,"PublicAffairs",4,"Que",292,"Red Gate Books",4,"Rockport Publishers",5,"Rocky Nook",17,"Rosenfeld Media",9,"Rough Guides",22,"Routledge",16,"SAS Institute",47,"Safari Books Online",6,"Salesforce.com",5,"Sams",461,"Sashay Communications",2,"SitePoint",43,"Smashing Magazine",44,"Stone River eLearning",9,"Sun Microsystems",5,"Sybex",138,"Syngress",110,"Technics Publications",18,"The USENIX Association",5,"TidBITS Publishing, Inc.",45,"Total Training, Inc.",6,"Train Simple",4,"VMware Press",14,"Virtual Training Company, Inc.",25,"Visual",34,"Weinstein Books",1,"Westview Press",1,"Wharton Digital Press",4,"Wiley",2,"Wiley-AIChE",1,"Wiley-Blackwell",9,"Wiley-IEEE Computer Society Press",1,"Wiley-IEEE Press",9,"Wiley-ISTE",4,"Wiley-Interscience",10,"Wiley-Scrivener",1,"William Andrew",1,"Woodhead Publishing",5,"Wrox",305,"Wrox Blox",11,"XML Press",11,"de Gruyter",3,"friends of ED",24,"i30 Media",2,"php[architect]",4]},"facet_intervals":{},"facet_dates":{}}}